Show / Hide Table of Contents
Class RebarHookBase
Represents a base class for rebar hook in 3D.
Inheritance
System.Object
OpenObject
RebarHookBase
RebarHookBend
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class RebarHookBase : OpenObject
Properties
Improve this Doc   View Source
AxisY
Gets or sets the position (direction) of the hook in 3D. It representa a Local Coordinate System. Hook lie in X-Y Plane. AxisX is defined by first/last segment of the rebar. AxisX and AxisY creates a plane where the hook lies.
Declaration
public Vector3D AxisY { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
Reverse
Reverse direction of the hook
Declaration
public bool Reverse { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source